<?php

declare(strict_types=1);

namespace App\Form\Type;

use Symfony\Component\Form\AbstractType;
use Symfony\Component\Form\ChoiceList\ChoiceList;
use Symfony\Component\Form\ChoiceList\Loader\CallbackChoiceLoader;
use Symfony\Component\Form\ChoiceList\Loader\ChoiceLoaderInterface;
use Symfony\Component\Form\Extension\Core\Type\ChoiceType;
use Symfony\Component\OptionsResolver\Options;
use Symfony\Component\OptionsResolver\OptionsResolver;

class RussianRegionType extends AbstractType
{
    /** @see https://www.consultant.ru/document/cons_doc_LAW_218074/449b2549a900cbe774193f4bfc87c864323b50b5/ */
    public const DEFAULT_CHOICES = [
        'Все регионы' => null,
        'г. Москва' => '77',
        'Алтайский край' => '22',
        'Амурская область' => '28',
        'Архангельская область' => '29',
        'Астраханская область' => '30',
        'Белгородская область' => '31',
        'Брянская область' => '32',
        'Владимирская область' => '33',
        'Волгоградская область' => '34',
        'Вологодская область' => '35',
        'Воронежская область' => '36',
        'г. Санкт-Петербург' => '78',
        'г. Севастополь' => '92',
        'Донецкая Народная Республика' => '93',
        'Еврейская автономная область' => '79',
        'Забайкальский край' => '75',
        'Запорожская область' => '96',
        'Ивановская область' => '37',
        'Иркутская область' => '38',
        'Кабардино-Балкарская Республика' => '07',
        'Калининградская область' => '39',
        'Калужская область' => '40',
        'Камчатский край' => '41',
        'Карачаево-Черкесская Республика' => '09',
        'Кемеровская область - Кузбасс' => '42',
        'Кировская область' => '43',
        'Костромская область' => '44',
        'Краснодарский край' => '23',
        'Красноярский край' => '24',
        'Курганская область' => '45',
        'Курская область' => '46',
        'Ленинградская область' => '47',
        'Липецкая область' => '48',
        'Луганская Народная Республика' => '95',
        'Магаданская область' => '49',
        'Московская область' => '50',
        'Мурманская область' => '51',
        'Ненецкий автономный округ' => '83',
        'Нижегородская область' => '52',
        'Новгородская область' => '53',
        'Новосибирская область' => '54',
        'Омская область' => '55',
        'Оренбургская область' => '56',
        'Орловская область' => '57',
        'Пензенская область' => '58',
        'Пермский край' => '59',
        'Приморский край' => '25',
        'Псковская область' => '60',
        'Республика Адыгея (Адыгея)' => '01',
        'Республика Алтай' => '04',
        'Республика Башкортостан' => '02',
        'Республика Бурятия' => '03',
        'Республика Дагестан' => '05',
        'Республика Ингушетия' => '06',
        'Республика Калмыкия' => '08',
        'Республика Карелия' => '10',
        'Республика Коми' => '11',
        'Республика Крым' => '91',
        'Республика Марий Эл' => '12',
        'Республика Мордовия' => '13',
        'Республика Саха (Якутия)' => '14',
        'Республика Северная Осетия - Алания' => '15',
        'Республика Татарстан (Татарстан)' => '16',
        'Республика Тыва' => '17',
        'Республика Хакасия' => '19',
        'Ростовская область' => '61',
        'Рязанская область' => '62',
        'Самарская область' => '63',
        'Саратовская область' => '64',
        'Сахалинская область' => '65',
        'Свердловская область' => '66',
        'Смоленская область' => '67',
        'Ставропольский край' => '26',
        'Тамбовская область' => '68',
        'Тверская область' => '69',
        'Томская область' => '70',
        'Тульская область' => '71',
        'Тюменская область' => '72',
        'Удмуртская Республика' => '18',
        'Ульяновская область' => '73',
        'Хабаровский край' => '27',
        'Ханты-Мансийский автономный округ - Югра' => '86',
        'Херсонская область' => '94',
        'Челябинская область' => '74',
        'Чеченская Республика' => '20',
        'Чувашская Республика - Чувашия' => '21',
        'Чукотский автономный округ' => '87',
        'Ямало-Ненецкий автономный округ' => '89',
        'Ярославская область' => '76',
    ];

    public function configureOptions(OptionsResolver $resolver): void
    {
        $resolver->setDefaults([
            'choice_loader' => function (Options $options): ?ChoiceLoaderInterface {
                return ChoiceList::loader(
                    $this,
                    new CallbackChoiceLoader(fn () => self::DEFAULT_CHOICES),
                );
            },
        ]);
    }

    public function getParent(): string
    {
        return ChoiceType::class;
    }
}
